src/Catalogs/ВнешниеЦКК/ВнешниеЦКК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнешниеЦКК</name>
  <attributes>
    <name>WSСсылкаInputStatisticsDate</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипВнешнегоЦКК</name>
    <type>
      <types>EnumRef.ТипыВнешнихЦКК</types>
    </type>
  </attributes>
  <attributes>
    <name>УИДПользователя</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортСчетчиков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнешниеЦКК</name>
    <attributes>
      <name>ПередаватьДанные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийЦКК</name>
      <type>
        <types>CatalogRef.ВнешниеЦКК</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/ТипыВнешнихЦКК/ТипыВнешнихЦКК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыВнешнихЦКК</name>
  <enumValues>
    <name>Главные</name>
  </enumValues>
  <enumValues>
    <name>Подчиненные</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ВнешниеЦКК/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьВнешниеЦККДляОтправки(Источник) Экспорт
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТЧ_ВнешниеЦКК.ВнешнийЦКК
	|ИЗ
	|	Справочник.ВнешниеЦКК КАК СправочникВнешниеЦКК
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.ВнешниеЦКК.ВнешниеЦКК КАК ТЧ_ВнешниеЦКК
	|ПО
	|	ТЧ_ВнешниеЦКК.Ссылка = СправочникВнешниеЦКК.Ссылка
	|	И ТЧ_ВнешниеЦКК.ПередаватьДанные = ИСТИНА
	|ГДЕ
	|	СправочникВнешниеЦКК.Пользователь = &Источник
	|	И СправочникВнешниеЦКК.ТипВнешнегоЦКК = &ТипВнешнегоЦКК
	|";
	
	Запрос.УстановитьПараметр("Источник", Источник);
	Запрос.УстановитьПараметр("ТипВнешнегоЦКК", Перечисления.ТипыВнешнихЦКК.Подчиненные);
	
	Результат = Запрос.Выполнить();
	ВнешниеЦКК = Новый Массив;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ВнешниеЦКК.Добавить(Выборка.ВнешнийЦКК);
	КонецЦикла;
	
	Возврат ВнешниеЦКК;
КонецФункции

Функция ПолучитьВнешниеЦККДляОтправкиСчетчиков() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СправочникВнешниеЦКК.Ссылка КАК ВнешнийЦКК
	|ИЗ
	|	Справочник.ВнешниеЦКК КАК СправочникВнешниеЦКК
	|ГДЕ
	|	СправочникВнешниеЦКК.ЭкспортСчетчиков = ИСТИНА
	|	И СправочникВнешниеЦКК.ТипВнешнегоЦКК = &ТипВнешнегоЦКК
	|";
	
	Запрос.УстановитьПараметр("ТипВнешнегоЦКК", Перечисления.ТипыВнешнихЦКК.Главные);
	Результат = Запрос.Выполнить();
	
	ВнешниеЦКК = Новый Массив;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ВнешниеЦКК.Добавить(Выборка.ВнешнийЦКК);
	КонецЦикла;
	
	Возврат ВнешниеЦКК;
КонецФункции

#КонецЕсли
